tests/vcr/tests.ouimeaux_device.test_maker/Test_Maker.test_turn_on.yaml

interactions:
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:SetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">

      <BinaryState>1</BinaryState>

      </u:SetBinaryState>

      </s:Body>

      </s:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '306'
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:basicevent:1#SetBinaryState"'
      User-Agent:
      - python-requests/2.25.1
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/basicevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"\
        http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:SetBinaryStateResponse\
        \ xmlns:u=\"urn:Belkin:service:basicevent:1\">\r\n<BinaryState>1</BinaryState>\r\
        \n</u:SetBinaryStateResponse>\r\n</s:Body> </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '285'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sat, 23 Jan 2021 10:58:35 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:GetAttributes xmlns:u="urn:Belkin:service:deviceevent:1">


      </u:GetAttributes>

      </s:Body>

      </s:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '277'
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:deviceevent:1#GetAttributes"'
      User-Agent:
      - python-requests/2.25.1
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/deviceevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"\
        http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:GetAttributesResponse\
        \ xmlns:u=\"urn:Belkin:service:deviceevent:1\">\r\n<attributeList>&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;Switch&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;Sensor&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;SwitchMode&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;SensorPresent&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;\n\
        </attributeList>\r\n</u:GetAttributesResponse>\r\n</s:Body> </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '867'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sat, 23 Jan 2021 10:58:35 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:GetAttributes xmlns:u="urn:Belkin:service:deviceevent:1">


      </u:GetAttributes>

      </s:Body>

      </s:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '277'
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:deviceevent:1#GetAttributes"'
      User-Agent:
      - python-requests/2.25.1
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/deviceevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"\
        http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:GetAttributesResponse\
        \ xmlns:u=\"urn:Belkin:service:deviceevent:1\">\r\n<attributeList>&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;Switch&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;Sensor&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;SwitchMode&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;&amp;lt;attribute&amp;gt;&amp;lt;name&amp;gt;SensorPresent&amp;lt;/name&amp;gt;&amp;lt;value&amp;gt;1&amp;lt;/value&amp;gt;&amp;lt;/attribute&amp;gt;\n\
        </attributeList>\r\n</u:GetAttributesResponse>\r\n</s:Body> </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '867'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sat, 23 Jan 2021 10:58:35 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
version: 1
